# FabricationVersionInfo Properties

---
The FabricationVersionInfo type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Reason|  The user-specified reason for the change.
| Version|  The version number of the change.
Top
#### Reference
FabricationVersionInfo Class
Autodesk.Revit.DB Namespace